tests/load-test.yml
config:
  target: "https://lisa-lashes-production.up.railway.app"
  phases:
    - duration: 30
      arrivalRate: 20
      name: "1. Normal Baseline"
    - duration: 60
      arrivalRate: 20
      rampTo: 150
      name: "2. Sharp Influx Spike"
    - duration: 90
      arrivalRate: 150
      rampTo: 400
      name: "3. Maximum Hostile Flood"
    - duration: 30
      arrivalRate: 400
      name: "4. Absolute Exhaustion Wall"

scenarios:
  - name: "Aggressive Public Crawl"
    flow: 
      - get:
          url: "/products/shop"
      - get:
          url: "/about/public"
      - get:
          url: "/gallery/public"